Autodesk.Revit.DB.ParameterTypeId.LayerElemThicknessParam
"Thickness": Thickness

Autodesk.Revit.DB.ParameterTypeId.LayerElemOffsetFromHostParam
"Offset From Host"

Autodesk.Revit.DB.ParameterTypeId.LayerTypeMaterialsParam
"Material": Material

Autodesk.Revit.DB.ParameterTypeId.LayerTypeThicknessParam
"Thickness": Thickness

Autodesk.Revit.DB.ParameterTypeId.RbsElecAnalyticalLoadSetOnStandby
"Quantity of Standby"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamShearPerpendicular
"Tension perpendicular to grain"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeRelativeRoughnessParam
"Relative Roughness"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeFrictionFactorParam
"Friction Factor"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeRoughnessParam
"Roughness"

Autodesk.Revit.DB.ParameterTypeId.RbsCurvetypeRoughnessParam
"Roughness"

Autodesk.Revit.DB.ParameterTypeId.LoadIsCreatedByApi
"Is created by API"

Autodesk.Revit.DB.ParameterTypeId.ContourSubcategoryId
"Subcategory"